sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan4x5x/TCAN4x5x_Reg.h
/*
 * TCAN4x5x_Reg.h
 * Description: This file contains the register definitions for the TCAN4x5x Family
 *
 * There are a few different define domains:
 *   - REG_MCAN_x: MCAN register address defines
 *   - MCAN_DLC_x: DLC values for the RX and TX FIFO element defines
 *   - REG_SPI_x : SPI Controller register address defines
 *   - REG_DEV_x : TCAN4x5x Device-specific register address defines
 *   - REG_BITS_x: Register bit defines in a similar manner as above.
 *   EX: REG_BITS_MCAN_CCCR_INIT is the hex value corresponding to the REG_MCAN_CCCR register's INIT bit
 *
 *
 *  Updated 10/12/2018
 *      - 1.0.1: Added Device IE Mask define
 *
 * Copyright (c) 2019 Texas Instruments Incorporated.  All rights reserved.
 * Software License Agreement
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the
 * distribution.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of
 * its contributors may be used to endorse or promote products derived
 * from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */



#ifndef TCAN4X5X_REG_H_
#define TCAN4X5X_REG_H_

#define MRAM_SIZE									2048

//*****************************************************************************
// Register Address Sections
//*****************************************************************************
#define REG_SPI_CONFIG								0x0000
#define REG_DEV_CONFIG								0x0800
#define REG_MCAN									0x1000
#define REG_MRAM									0x8000


//*****************************************************************************
// SPI Registers and Device ID Register Addresses: 	0x0000 Prefix
//*****************************************************************************
#define REG_SPI_DEVICE_ID0							0x0000
#define REG_SPI_DEVICE_ID1							0x0004
#define REG_SPI_REVISION							0x0008
#define REG_SPI_STATUS								0x000C
#define REG_SPI_ERROR_STATUS_MASK					0x0010


//*****************************************************************************
// Device Configuration Register Addresses: 	0x0800 Prefix
//*****************************************************************************
#define REG_DEV_MODES_AND_PINS						0x0800
#define REG_DEV_TIMESTAMP_PRESCALER					0x0804
#define REG_DEV_TEST_REGISTERS						0x0808
#define REG_DEV_IR									0x0820
#define REG_DEV_IE									0x0830


//*****************************************************************************
// MCAN Register Addresses: 	0x1000 Prefix
//*****************************************************************************
#define REG_MCAN_CREL								0x1000
#define REG_MCAN_ENDN								0x1004
#define REG_MCAN_CUST								0x1008
#define REG_MCAN_DBTP								0x100C
#define REG_MCAN_TEST								0x1010
#define REG_MCAN_RWD								0x1014
#define REG_MCAN_CCCR								0x1018
#define REG_MCAN_NBTP								0x101C
#define REG_MCAN_TSCC								0x1020
#define REG_MCAN_TSCV								0x1024
#define REG_MCAN_TOCC								0x1028
#define REG_MCAN_TOCV								0x102C
#define REG_MCAN_ECR								0x1040
#define REG_MCAN_PSR								0x1044
#define REG_MCAN_TDCR								0x1048
#define REG_MCAN_IR									0x1050
#define REG_MCAN_IE									0x1054
#define REG_MCAN_ILS								0x1058
#define REG_MCAN_ILE								0x105C
#define REG_MCAN_GFC								0x1080
#define REG_MCAN_SIDFC								0x1084
#define REG_MCAN_XIDFC								0x1088
#define REG_MCAN_XIDAM								0x1090
#define REG_MCAN_HPMS								0x1094
#define REG_MCAN_NDAT1								0x1098
#define REG_MCAN_NDAT2								0x109C
#define REG_MCAN_RXF0C								0x10A0
#define REG_MCAN_RXF0S								0x10A4
#define REG_MCAN_RXF0A								0x10A8
#define REG_MCAN_RXBC								0x10AC
#define REG_MCAN_RXF1C								0x10B0
#define REG_MCAN_RXF1S								0x10B4
#define REG_MCAN_RXF1A								0x10B8
#define REG_MCAN_RXESC								0x10BC
#define REG_MCAN_TXBC								0x10C0
#define REG_MCAN_TXFQS								0x10C4
#define REG_MCAN_TXESC								0x10C8
#define REG_MCAN_TXBRP								0x10CC
#define REG_MCAN_TXBAR								0x10D0
#define REG_MCAN_TXBCR								0x10D4
#define REG_MCAN_TXBTO								0x10D8
#define REG_MCAN_TXBCF								0x10DC
#define REG_MCAN_TXBTIE								0x10E0
#define REG_MCAN_TXBCIE								0x10E4
#define REG_MCAN_TXEFC								0x10F0
#define REG_MCAN_TXEFS								0x10F4
#define REG_MCAN_TXEFA								0x10F8
//*****************************************************************************


//*****************************************************************************
// DLC Value Defines: Used for RX and TX elements. The DLC[3:0] bit field
//*****************************************************************************
#define MCAN_DLC_0B									0x00000000
#define MCAN_DLC_1B									0x00000001
#define MCAN_DLC_2B									0x00000002
#define MCAN_DLC_3B									0x00000003
#define MCAN_DLC_4B									0x00000004
#define MCAN_DLC_5B									0x00000005
#define MCAN_DLC_6B									0x00000006
#define MCAN_DLC_7B									0x00000007
#define MCAN_DLC_8B									0x00000008
#define MCAN_DLC_12B								0x00000009
#define MCAN_DLC_16B								0x0000000A
#define MCAN_DLC_20B								0x0000000B
#define MCAN_DLC_24B								0x0000000C
#define MCAN_DLC_32B								0x0000000D
#define MCAN_DLC_48B								0x0000000E
#define MCAN_DLC_64B								0x0000000F
//*****************************************************************************




//*****************************************************************************
// MCAN Register Bit Field Defines
//*****************************************************************************

